"""
Это решение задачи по приготволение лазаньи
первая функция вовзращает число которое осталосьна выпикание лазаньи
Вторая функция возвращает время которое уходит на приготовление количество слоев которые передаются в функцию
"""
EXPECTED_BAKE_TIME = 40
def bake_time_remaining(a: int) -> int:
    """
    Эта функция принимает число " Сколько прошло времени как продукт выпекается"
    и потом возвращает число которе осталось на выпекание лазаньи
    """
    return EXPECTED_BAKE_TIME-a

def preparation_time_in_minutes(number_of_lovers: int) -> int:
    """
    Функция принимает число сколько слоев еще осталось выпечь
    и возвращает число(время) на их приготовление 
    ...количество слоев * на их время приготовления...
    
    """
    return number_of_lovers * 2


def elapsed_time_in_minutes(number_of_layers: int, elapsed_bake_time: int) -> int: 
    """
    Функция принимает два числа
    1: количество слоев
    2: Время которое вы уже проверили на кухне за готовкой
    и возвращает число общее которе потребовалось на приготволение слоев и выпечки лазаньи
    
    
    """
    return number_of_layers * 2 + elapsed_bake_time



    

    




